assignment-01/Backend/performanceTest/facultyTest.yml
config:
  target: "http://localhost:8070" 
  phases:
    - duration: 60 
      arrivalRate: 10 

scenarios:
  - name: "Faculty Registration"
    flow:
      - post:
          url: "/api/fac/faculties"
          json:
            fullName: "John Doe"
            dob: "1990-01-01"
            address: "123 Main Street"
            phone: "+947123456789"
            email: "john.doe@example.com"
            password: "Password123#"

  - name: "Faculty Login"
    flow:
      - post:
          url: "/api/fac/FacultyLogin"
          json:
            email: "john.doe@example.com"
            password: "Password123#"
          capture:
            as: "token"
            json: $.token 
    
  - name: "Get All faculties"
    flow:
      - get:
          url: "/api/fac/faculties"
          headers:
            Authorization: "Bearer {{ token }}" 
  
  - name: "Get Faculty by ID"
    flow:
      - get:
          url: "/api/fac/F1005"
          headers:
            Authorization: "Bearer {{ token }}" 
  
  - name: "Update Faculty"
    flow:
      - put:
          url: "/api/fac/F1005"
          json:
            fullName: "John Doe Jr."
            dob: "1995-01-01"
            address: "456 Oak Street"
            phone: "+947987654321"
            email: "john.doe@example.com"
            password: "NewPassword123#"
          headers:
            Authorization: "Bearer {{ token }}"  

  - name: "Delete Faculty"
    flow:
      - delete:
          url: "/api/fac/F1005"
          headers:
            Authorization: "Bearer {{ token }}"