assignment-01/Backend/performanceTest/studentTest.yml
config:
  target: "http://localhost:8070"  
  phases:
    - duration: 60 
      arrivalRate: 10 

scenarios:
  - name: "Student Registration"
    flow:
      - post:
          url: "/api/stu/students"
          json:
            fullName: "John Doe"
            dob: "1990-01-01"
            address: "123 Main Street"
            phone: "+947123456789"
            email: "john.doe@example.com"
            password: "Password123#"

  - name: "Student Login"
    flow:
      - post:
          url: "/api/stu/stuLogin"
          json:
            email: "john.doe@example.com"
            password: "Password123#"
          capture:
            as: "token" 
            json: $.token 
    
  - name: "Get All Students"
    flow:
      - get:
          url: "/api/stu/students"
          headers:
            Authorization: "Bearer {{ token }}" 
  
  - name: "Get Student by ID"
    flow:
      - get:
          url: "/api/stu/IT2405"
          headers:
            Authorization: "Bearer {{ token }}"
  
  - name: "Update Student"
    flow:
      - put:
          url: "/api/stu/IT2405"
          json:
            fullName: "John Doe Jr."
            dob: "1995-01-01"
            address: "456 Oak Street"
            phone: "+947987654321"
            email: "john.doe@example.com"
            password: "NewPassword123#"
          headers:
            Authorization: "Bearer {{ token }}"  

  - name: "Delete Student"
    flow:
      - delete:
          url: "/api/stu/IT2405"
          headers:
            Authorization: "Bearer {{ token }}"